src/test/resources/de/erichambuch/securitytokenservice/service/invalidRequest_requestType.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
   <S:Header>
   </S:Header>
   <S:Body>
      <ns3:RequestSecurityToken xmlns:ns1="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:ns2="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:ns3="http://schemas.xmlsoap.org/ws/2005/02/trust" xmlns:ns4="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:ns5="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:ns6="http://www.w3.org/2000/09/xmldsig#" xmlns:ns7="http://www.bipro.net/namespace">
         <wst:TokenType xmlns:wst="http://schemas.xmlsoap.org/ws/2005/02/trust">http://schemas.xmlsoap.org/ws/2005/02/sc/sct</wst:TokenType>
         <wst:RequestType xmlns:wst="http://schemas.xmlsoap.org/ws/2005/02/trust">http://schemas.xmlsoap.org/ws/2005/02/trust/IssueINVALID</wst:RequestType>
      </ns3:RequestSecurityToken>
   </S:Body>
</S:Envelope>